{
    "additionalImages":  {

                         },
    "slug":  "building-thedapperfoxes",
    "id":  "building-thedapperfoxes",
    "shortDescription":  "How we designed and built a wedding website that reflects our personalities, aesthetics, and engineering strengths.",
    "featuredImage":  "/images/blog/building-thedapperfoxes/building-thedapperfoxes-featured-image.png",
    "content":  [
                    {
                        "content":  "\u003ch2\u003e🦊 Building TheDapperFoxes.com: A Website Worthy of a Love Story\r\u003c/h2\u003e\n\n\u003cp\u003eWhen we set out to build our wedding website, we knew we wanted it to reflect \u003cem\u003eus\u003c/em\u003e—not just the event, but the vibe. Something charming, a little cheeky, visually cohesive, and flexible enough to hold everything from heartfelt backstory to guest-uploaded chaos. Enter: \u003cstrong\u003eTheDapperFoxes.com\u003c/strong\u003e.\u003c/p\u003e\n\n\u003ch3\u003e🎨 The Aesthetic\r\u003c/h3\u003e\n\n\u003cp\u003eWe built the look around our signature colors: \u003cstrong\u003eteal and sunset orange\u003c/strong\u003e, with accents of silver and soft neutrals. The palette blends modern and whimsical, with enough contrast to keep things lively. Our favicon—two foxes in love, complete with top hat and veil—became the visual heartbeat of the site. (And yes, they’re in love. Obviously.)\u003c/p\u003e\n\n\u003ch3\u003e🛠️ The Tools\r\u003c/h3\u003e\n\n\u003cp\u003eThe site runs on custom code collaboratively written by Emily and Roo, her agentic AI dev assistant—Emily handled the logic, flow, and integration while Roo helped streamline repetitive tasks. Sean, naturally, gave all copy the British polish test. We used:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA sprinkle of \u003cstrong\u003eApps Script\u003c/strong\u003e to power photo submission approvals\r\u003c/li\u003e\n\n\u003c/ul\u003e\n\u003cp\u003eWe also wrangled Google Forms, Sheets, and Drive in ways that Google did not intend—because of course we did.\u003c/p\u003e\n\n\u003ch3\u003e📸 The Photo Gallery\r\u003c/h3\u003e\n\n\u003cp\u003eOne of the best parts? Our collaborative photo gallery. Guests can upload their own shots to contribute to our slideshow—and approve them via a private, login-only interface. It took a few headaches (Glide, AppSheet, and API permission gremlins were all involved), but we got there.\u003c/p\u003e\n\n\u003ch3\u003e📍 The Poll\r\u003c/h3\u003e\n\n\u003cp\u003eWe built an interactive poll to help friends and family weigh in on potential wedding locations. It’s not binding (we are not monsters), but it’s a delightful way to include the community—and play with our color palette logic, which assigns each location a unique shade from one of three curated families.\u003c/p\u003e\n\n\u003ch3\u003e💻 The Experience\r\u003c/h3\u003e\n\n\u003cp\u003eIn the end, TheDapperFoxes.com became more than just a wedding website—it’s a showcase of systems thinking disguised as whimsy. From architecture to copy, every element reflects thoughtful design, seamless integration, and an unapologetically human touch.\u003c/p\u003e\n\n\u003cp\u003eWe used Google Apps Script to create lightweight, secure approval flows for both the guest photo gallery and the location poll comment feature. These scripts handle the moderation logic behind the scenes, allowing us to manage guest-generated content gracefully—without introducing friction for the user.\u003c/p\u003e\n\n\u003cp\u003eEmily led the development from concept to execution, blending aesthetics with infrastructure and handling everything from cross-platform automation to interface consistency. Building it as a couple was part of the fun—making it scale gracefully across form responses, guest engagement, and emotional tone? That was the challenge. And the reward.\u003c/p\u003e\n\n\u003cp\u003e---\u003c/p\u003e\n\n\u003cstrong\u003eComing soon:\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eMore Easter eggs 🥚\r\u003c/li\u003e\n\n\u003c/ul\u003e\n\u003cdiv align=\"right\"\u003e\u003csub\u003e\u003cem\u003ePowered by Sparky ⚡️\u003c/em\u003e\u003c/sub\u003e\u003c/div\u003e",
                        "type":  "html"
                    }
                ],
    "tags":  [
                 "Wedding",
                 "Web Design",
                 "Custom Development",
                 "Apps Script",
                 "Google Forms",
                 "AI Assistant",
                 "Agentic AI",
                 "Event Tech"
             ],
    "author":  "Emily Anderson",
    "date":  "2025-04-19",
    "bannerImage":  "",
    "title":  "Building TheDapperFoxes.com: A Website Worthy of a Love Story",
    "featured":  true
}
