[
  {
    "pdfPath": "presentations/posted/A Journey Through The Cosmos_ My Visit to JPL.pdf",
    "thumbnail": "images/presentations/jpl-visit.png",
    "relatedBlogPostUrl": "blog-post.html?id=jpl-ai-blog",
    "longDescriptionMarkdown": "---\ntitle: \"A Journey Through the Cosmos: My First AI-Generated Slide Adventure 🚀\"\nauthor: Emily Anderson\ntags: [JPL, AI, Presentation, Space Exploration, NASA]\ndescription: \"Reflections on visiting NASA's Jet Propulsion Laboratory and using AI to create a presentation.\"\n---\n\nI recently had the opportunity to visit NASA’s Jet Propulsion Laboratory (JPL)—a behind-the-scenes glimpse into some of the most iconic space exploration missions of our time. From the Mars Yard and Mission Control to the Europa Clipper and Mars Sample Return plans, the experience was unforgettable.\n\nTo commemorate the trip, I put together a presentation using an AI slide generator—my first time leveraging generative tools to build a deck. While I added my own context and commentary throughout, the majority of the structure and visuals came straight from the AI. It turned out to be a fun experiment in letting technology help tell the story of... technology.\n\nCheck out the highlights from my visit, learn more about the incredible work happening at JPL, and follow along as I continue to explore how AI can streamline storytelling—on Earth and beyond. 🌌",
    "cardMarkdownPath": "presentations/posted/jpl-visit-presentation.md"
  },
  {
    "pdfPath": "presentations/posted/Generative AI - GDG .pdf",
    "thumbnail": "images/presentations/getting-started-with-ai-featured.jpg",
    "relatedBlogPostUrl": "/blog-post.html?slug=getting-started-with-ai",
    "cardMarkdownPath": "presentations/posted/generative-ai-gdg-card.md",
    "longDescriptionMarkdown": "---\ntitle: \"Generative AI: Considerations for Use in Corporate Enterprises\"\ntags: [AI, Generative AI, GDG, Enterprise AI, Machine Learning, Security, Ethics]\n---\n\nPresented at GDG Twin Cities, this session explores the evolution of generative AI, practical industry applications, and critical security and ethical considerations enterprises must address."
  },
  {
    "pdfPath": "presentations/posted/ai-empathy-iwd.pdf",
    "thumbnail": "images/presentations/empathy-ai-featured.png",
    "cardMarkdownPath": "presentations/posted/empathy-ai-presentation-card.md",
    "relatedBlogPostUrl": null,
    "longDescriptionMarkdown": "---\ntitle: \"Empathy & AI: Building Emotional Intelligence into Technology\"\ntags: [AI, Empathy, Ethics, Sentiment Analysis, Diversity, Human-Centered Design]\n---\n\nExplore how emotional nuance, inclusive design, and a social work lens can help build more empathetic AI systems. This talk delves into what happens when social work meets machine learning, covering why AI often misreads human emotion, real-world examples from emotional AI design, and strategies for building empathy into systems using inclusive datasets and user testing. Learn how emotionally intelligent AI can create more human-centered technology. (This presentation also marks a second experiment using generative AI for slide creation.)"
  }
]