[
  {
    "pdfPath": "presentations/posted/Building With Agentic AI.pdf",
    "thumbnail": "images/presentations/building-with-agentic-ai-featured.png",
    "relatedBlogPostUrl": "/blog/building-with-agentic-ai/",
    "cardMarkdownPath": "presentations/posted/building-with-agentic-ai-card.md",
    "longDescriptionMarkdown": "---\ntitle: \"Building With Agentic AI\"\n---\n\n\"Building With Agentic AI\" explores how next-generation AI tools empower developers rather than replace them. This presentation walks through the mindset shift from automation anxiety to orchestration mastery—showing how agentic systems can collaborate with humans across architecture, coding, debugging, and documentation. It also dives into real examples of autonomous project builds and creative demos like Productizer, an AI-powered product analysis tool with a delightfully monstrous personality. Presented at Google Playa Vista - The Spruce Goose Hangar on August 22, 2025."
  },
  {
    "pdfPath": "presentations/posted/A Journey Through The Cosmos_ My Visit to JPL.pdf",
    "thumbnail": "images/presentations/jpl-visit.png",
    "relatedBlogPostUrl": "/blog/jpl-ai-blog/",
    "longDescriptionMarkdown": "---\ntitle: \"A Journey Through the Cosmos: My First AI-Generated Slide Adventure 🚀\"\n---\n\nI had the incredible opportunity to visit NASA’s Jet Propulsion Laboratory (JPL) for a behind-the-scenes look at the missions shaping the future of space exploration. From the Mars Yard and Mission Control to the Europa Clipper and Mars Sample Return, it was a dream come true. To commemorate the experience, I created a slide deck using a generative AI tool—my first time experimenting with AI-powered storytelling. While I provided the voice and context, the structure and visuals were shaped by the AI. It was a fun and surprisingly effective way to blend personal narrative with emerging tech.",
    "cardMarkdownPath": "presentations/posted/jpl-visit-presentation.md"
  },
  {
    "pdfPath": "presentations/posted/Generative AI - GDG .pdf",
    "thumbnail": "images/presentations/getting-started-with-ai-featured.jpg",
    "relatedBlogPostUrl": "/blog/getting-started-with-ai/",
    "cardMarkdownPath": "presentations/posted/generative-ai-gdg-card.md",
    "longDescriptionMarkdown": "---\ntitle: \"Generative AI: Considerations for Use in Corporate Enterprises\"\n---\n\nPresented at GDG Twin Cities, this talk dives into how generative AI is transforming the enterprise landscape. I explore its practical applications across industries, from content creation to automation, while unpacking the critical risks that come with implementation. Topics include model security, data privacy, ethical concerns, and long-term governance. The session serves as both a primer and a call-to-action for leaders navigating the evolving AI ecosystem. It also marked one of my earliest uses of generative tools to structure and design a presentation—an experiment in letting AI help explain itself."
  },
  {
    "pdfPath": "presentations/posted/ai-empathy-iwd.pdf",
    "thumbnail": "images/presentations/empathy-ai-featured.png",
    "cardMarkdownPath": "presentations/posted/empathy-ai-presentation-card.md",
    "relatedBlogPostUrl": null,
    "longDescriptionMarkdown": "---\ntitle: \"Empathy & AI: Building Emotional Intelligence into Technology\"\n---\n\nWhat happens when you blend social work, machine learning, and a bit of heart? This session explores how inclusive design, emotional nuance, and user-centered research can be used to build more empathetic AI systems. I share real-world examples of where emotional AI gets it wrong—and where it gets it right—with insights on designing systems that better understand human context. This was my second experiment using AI to generate a slide deck, pairing personal insight with emerging tools to rethink how we teach machines to understand us."
  }
]